Repository: AdastralGroup/tyne
Catalog: locale/*/LC_MESSAGES/tf2c-downloader.po
Languages: hu

source: Extracting the downloaded archive, please wait patiently.
hu: A letöltött archívum kicsomagolása, kérlek várj türelemmel.

source: %s byte
hu: %s bájt

source: You don't have enough free space for the download. A minimum of %s on your primary drive is required.
hu: Nincs elég tárhelyed, hogy letöltsd a TF2 Classic-ot. %s minimum tárhely szükséges az elsődleges merevlemezeden.

source: The specified extraction location does not exist.
hu: A meghatározott kicsomagolási hely nem létezik.

source: You don't have enough free space for the extraction. A minimum of %s at your chosen extraction site is required.
hu: Nincs elég tárhelyed, hogy kicsomagold a TF2 Classic-ot. %s minimum tárhely szükséges az általad választott kicsomagolási helyen.

source: Getting the archive...
hu: Archívum megszerzése...

source: Getting %s patch...
hu: %s javítás megszerzése...

source: Downloading patch %s to %s...
hu: %s javítás letöltése ide: %s...

source: yes
hu: igen

source: no
hu: nem

source: {y/n}
hu: {i/n}

source: {Y/n}
hu: {I/n}

source: {y/N}
hu: {i/N}

source: [bold blue]Please respond with 'yes' or 'no' (or 'y' or 'n').[/bold blue]
hu: [bold blue]Válaszolj kérlek egy 'igen' vagy 'nem'-mel (vagy 'i' vagy 'n').[/bold blue]

source: [bold]You are safe to close this window.
hu: [bold]Mostmár biztonságban bezárhatod ezt az ablakot.

source: Press Enter to exit.
hu: Kilépéshez nyomd meg az Enter billentyűt.

source: Installation location not precised, will assume: %s
hu: Telepítési hely nem meghatározva, telepítési hely: %s

source: Sourcemods folder was automatically found at: %s
hu: A sourcemods mappa automatikusan meglelve itt: %s

source: It's the recommended installation location. Would you like to install TF2 Classic there?
hu: Ez a javasolt telepítési hely. Szeretnéd oda telepíteni a TF2 Classic-ot?

source: WARNING: Steam's sourcemods folder has not been found, or you chose not to use it.
hu: FIGYELEM: Nem lett megtalálva a Steam sourcemods mappája, vagy te döntöttél úgy, hogy nem használod azt.

source: Would you like to extract in %s? You must move it to your sourcemods manually.
hu: Szeretnéd ide kicsomagolni: %s? Sajátkezüleg kell majd betenned a sourcemods mappádba.

source: Please, enter the location in which TF2 Classic will be installed to.
hu: Add meg a helyet ahova szeretnéd a TF2 Classic-ot telepíteni.

source: TF2 Classic will be installed in %s Do you accept?
hu: A TF2 Classic ide lesz telepítve: %s Elfogadod?

source: Reinitialising...
hu: Újrainicializálás...

source: You need to install Aria2 to use this script.
hu: Ehhez a script-hez a következőt kell telepítened: Aria2.

source: Looks like we're running in the background. We don't want that, so we're exiting.
hu: Úgy néz ki, hogy a háttérben futtatod a programot. Ezt mi nem akarjuk, szóval kilépünk.

source: Starting the download for TF2 Classic... You may see some errors that are safe to ignore.
hu: TF2 Classic letöltésének megkezdése... Lehet, hogy látsz néhány hibát amit nyugodtan mellőzhetsz.

source: The installation has successfully completed. Remember to restart Steam!
hu: A telepítés sikeres. Ne felejtsd újraindítani a Steam-et!

source: The update has successfully completed.
hu: A frissítés sikeres.

source: [italic magenta]----- Exception details above this line -----
hu: [italic magenta]----- Kifogás részletei e sor fölött -----

source: [bold red]:warning: The program has failed. Post a screenshot in #technical-issues on the Discord. :warning:[/bold red]
hu: [bold red]:warning: A program sikertelen. Készíts egy képernyőképet és küld el a #technical-issues csatornába a hivatalos Discord szerveren (de csak Angolul). :warning:[/bold red]

source: TF2 Classic is already installed. Assuming a reinstallation.
hu: A TF2 Classic már telepítve van. Újratelepítés feltételezése...

source: TF2 Classic isn't installed, cannot do an update. Consider using --install instead.
hu: A TF2 Classic nincs telepítve, így nem lehet frissíteni. Használd inkább az --install parancsot.

source: Unrecognised command. Try --help
hu: Ismeretlen parancs. Próbáld a --help parancsot

source: Applying safety blacklist...
hu: Biztonsági feketelistára helyezés...

source: WARNING: could not apply safety blacklist.
hu: FIGYELEM: sikertelen biztonsági feketelistára helyezés.

source: Could not get version list. If your internet connection is fine, the servers could be having technical issues.
hu: Verziólista megszerzése sikertelen. Ha rendben van az internet kapcsolatod, akkor a szerverekkel lehet technikai probléma.

source: We can't read the version of your installation. It could be corrupted. Do you want to reinstall the game?
hu: Játékverzió beolvasása sikertelen. Lehetséges, hogy sérült. Szeretnéd újratelepíteni a játékot?

source: We have nothing to do. Goodbye!
hu: Semmit se kell csinálnunk. Viszlát!

source: The version of your installation is unknown. It could be corrupted. Do you want to reinstall the game?
hu: A játékod verziószáma ismeretlen. Lehetséges, hogy sérült. Szeretnéd újratelepíteni a játékot?

source: We think we've found an existing up-to-date installation of the game. Do you want to reinstall it?
hu: Úgy tűnik találtunk egy létező friss játék telepítést. Szeretnéd újratelepíteni?

source: An update is available for your game. Do you want to install it?
hu: Egy frissítés érhető el a játékodhoz. Szeretnéd telepíteni?

source: In that case, do you want to reinstall completely?
hu: Ebben az esetben, szeretnéd teljesen újratelepíteni?
